Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ཨུཏྤ་ལ་སྔོན་པོའི་ཕྱི་རོལ་ཏུ་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་པས་རྣམ་པར་བཀྲ་བའི་རི་མོ་འབར་བའི་ཕྲེང་བས་མཛེས་པའོ།
en: Outside the garlands he should draw a line of various jewels and gems, and outside of that line, the syllables from the maṇi mantra nicely arranged in a blazing row.

source: །མེ་ཏོག་སྣ་མ་དང་། ཙམ་པ་ཀའི་ཕྲེང་བ་དག་ལ་སྔགས་ཀྱི་ནོར་བུའི་རི་མོ་ཡང་བྱའོ།
en: He should also draw garlands of jasmine and champak flowers outside the line of gems. “

source: །དེའི་ཕྱི་རོལ་གྱི་ཁོར་ཡུག་ཏུ་སྣམ་བུའི་རྣམ་པ་བྱའོ། །རི་བོ་ལ་སྣ་ཚོགས་པའི་ལྗོན་ཤིང་དང་ལྕུག་མ་བཀྲམ་པ་དང་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཉེ་བར་མཛེས་པའོ།
en: Surrounding all this, the vidyā holder should draw a terraced mountain covered in various trees and vines and adorned with various blossoms and flowers.

source: །ཁོར་ཡུག་ཏུ་ཆུ་འབབ་པའི་སྙིང་པོའི་དཀྱིལ་འཁོར་འདི་བྲི་ཞིང་ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུའང་བྲི་བར་བྱ་སྟེ།
en: He should then draw streams of water flowing on all sides so that they surround this inner maṇḍala.

source: དཀྱིལ་འཁོར་བླ་ན་མེད་པ་ཕྱག་རྒྱ་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དང་། བུམ་པ་དང་མཆོད་པའི་རིན་པོ་ཆེའི་སྣོད་སྣ་ཚོགས་པ་དང་། གང་བའི་བུམ་པ་སྣ་ཚོགས་པ་བྲིའོ།
en: Outside of this, in the outer maṇḍala zone, he should draw various mudrā gestures and a variety of flowers, jewels, bowls, pitchers, and jars filled with offerings.

source: །མཚན་མ་དང་། ཕྱག་རྒྱ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་པའི་ཡལ་ག་དང་། པདྨ་དང་། ཨུཏྤལ་འཆང་བ་གོས་དང་རྒྱན་སྣ་ཚོགས་པ་ཐོགས་པ་བྱའོ།
en: He should draw hands displaying mudrā gestures and holding various jewels, branches, white and blue lotuses, various types of cloth, and adornments.

source: །ཕྱིའི་དཀྱིལ་འཁོར་གྱི་ཁོར་ཡུག་ཏུ་མེ་ཏོག་སྣ་ཚོགས་པ་ཀུ་མུ་ད་དང་། པདྨ་དཀར་པོ་དང་། མན་དཱ་ར་བ་དང་། ཨ་ཏི་མུཀྟ་ཀ་དང་། ཝཱརྵི་ཀ་དང་། ཙམ་པ་ཀ་དང་། ཨུཏྤ་ལ་སྔོན་པོ་དང་།
en: Surrounding all this, he should draw garlands of various flowers such as lotuses and water lilies, mandārava, atimukta, vārṣika, champak, blue lotuses, sumanas, trumpet-tree blossoms, yūthika, and kadamba blossoms. “

source: སྣ་མ་དང་། སྐྱ་སྣར་དང་། ཡཱུ་ཐི་ཀ་དང་། ཀ་དམ་པའི་མེ་ཏོག་གི་ཕྲེང་བས་མཛེས་པར་བྱའོ། །སྒོ་བཞིའི་གནས་སུ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པར་བྱ་སྟེ། རིན་པོ་ཆེའི་ལྕུག་མ་སྣ་ཚོགས་པ་དང་།
en: At each of the four doors the vidyā holder should place an earthenware pot filled with offerings and adorned with all ornaments and decorative vines.

source: བུམ་པ་གང་བ་ཐོགས་པར་བྱའོ། །དཀྱིལ་འཁོར་གྱི་སྙིང་པོར་བ་དན་གྱིས་བརྒྱན་པར་བྱའོ། །གང་བའི་བུམ་པ་ཡོངས་སུ་བསགས་པ་དང་། མེ་ཏོག་དང་འབྲས་བུ་སྣ་ཚོགས་པ་དང་། སྣ་ཚོགས་པའི་གཟུགས་དང་བཟའ་བའི་ཁ་ཟས་རོ་བྲོ་བའི་མཆོག་གཞག་པར་བྱ།
en: He should also adorn the maṇḍala with arrows and banners and set out full jars, various flowers and fruits, and various foods of exquisite flavor.

source: སྣ་ཚོགས་པའི་བདུག་པས་བདུགས་ལ།
en: He should burn various types of incense in incense burners arranged all around the maṇḍala. “

source: བདུག་པའི་བོག་ཕོར་ཡོངས་སུ་བཤམ་པར་བྱའོ། །རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོ་བར་བྱ་ལེགས་པར་ཁྲུས་བྱས་ཤིང་དྲི་བཟང་པོའི་དྲིས་བསྒོས་ཏེ།
en: He should then purify himself ritually, take a bath, put on clean clothes, and perfume himself with nice scents.

source: རྣམ་པ་སྣ་ཚོགས་པའི་བདུག་པས་བདུགས་ལ།
en: He should fumigate himself with fine incense and smear himself with the five products of the cow.

source: འབྱུང་ལྔས་ཉེ་རེག་བྱ་སྟེ་དོན་ཡོད་པ་ནོར་བུའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་འདི་ལན་སྟོང་རྩ་བརྒྱད་དུ་བཟླས་པར་བྱའ།
en: He should then recite the heart dhāraṇī of precious amogha offerings one thousand and eight times.

source: །དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་རྡུལ་ཕྲ་རབ་ཀྱི་གྲངས་དང་མཉམ་པ་ཡིད་ལ་བྱ།
en: While reciting, he should visualize great clouds of offerings for all the tathāgatas of the three times, who are as numerous as the particles of dust in the universe.

source: མཆོད་པའི་སྤྲིན་ཆེན་པོ་ཡིད་ལ་བྱ་ཞིང་བཟླ་སྟེ་ཕྱོགས་བཅུ་ཀུན་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ནང་དུ་གཏོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེའི་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་རྡུལ་ཕྲ་རབ་རྣམས་དེ་བཞིན་གཤེགས་པའི་མཆོད་པའི་སྤྲིན་གྱིས་ཇི་ལྟར་དཀྱིལ་འཁོར་དུ་ཡོངས་སུ་བསགས་ཤིང་རྣམ་པ་སྣ་ཚོགས་སུ་གཞལ་དུ་མེད་པས་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བསགས་པའི་དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཡང་དཀྱིལ་འཁོར་ཆེན་པོ་གཞལ་དུ་མེད་པ་བརྒྱ་སྟོང་ཕྲག་ཡོངས་སུ་བསགས་པས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མཆོད་པའི་སྤྲིན་ཆེན་པོ་བྱེད་དོ།
en: He should make offerings to all the blessed buddhas dwelling in all the buddha fields in the ten directions. He should offer great clouds of offerings, like those piled up in the maṇḍala, to each and every one of these tathāgatas established throughout the three times, in every buddha field, as numerous as the particles of dust in the universe. He should make offerings to each tathāgata individually, and he should continually send great clouds of offerings to the blessed ones, offerings that consist of hundreds of thousands of visualized maṇḍalas piled with offerings. “

source: །སྣ་ཚོགས་པའི་གོས་དང་། སྣ་ཚོགས་པའི་རྒྱན་དང་། ལྷབ་ལྷུབ་དང་། ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་པ་དང་། ལྷ་རྫས་ཀྱི་དྲི་སྣ་ཚོགས་པ་དང་། ལྷ་རྫས་ཀྱི་བདུག་སྤོས་སྣ་ཚོགས་པ་དང་། ལྷ་རྫས་ཀྱི་འབྲས་བུ་དང་། མེ་ཏོག་སྣ་ཚོགས་པ་དང་། རོ་བརྒྱ་པའི་ཁ་ཟས་ཀྱི་མཆོག་རོ་བྲོ་བའི་མཆོག་རྣམ་པ་སྣ་ཚོགས་པ་དང་།
en: The offerings should include various pieces of clothing, ornaments, and adornments, various divine flowers, exquisite fragrances, fine incense, various divine fruits and flowers, various types of delicious food with hundreds of superb flavors, and various trees lit with lamps.

source: སྒྲོན་མའི་ཤིང་སྣ་ཚོགས་པ་བརྒྱ་སྟོང་ཕྲག་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རེ་རེའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས་པ་ལ་མཆོད་པའི་སྤྲིན་ཆེན་པོ་བྱེད་དོ།
en: To each and every tathāgata and his retinue, the vidyā holder should offer these items by the hundreds of thousands in the form of great unceasing clouds of offerings.

source: །ཡན་ལག་ལྔ་དང་ལྡན་པའི་ལྷ་རྫས་ཀྱི་རོལ་མོའི་སྒྲ་རྣམས་ཀྱི་མཆོད་པའི་སྤྲིན་བྱེད་དོ།
en: He should also offer cloud-like offerings of divine music of five types.

source: །དེ་ལྟ་བུའི་ཆོ་ག་རྣམས་ཕྱོགས་བཅུ་རྣམས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེའི་དེ་བཞིན་གཤེགས་པ་རེ་རེའི་མཆོད་པའི་སྤྲིན་ཆེན་པོས་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་རྡུལ་ཕྲ་རབ་ཀྱི་གྲངས་རྣམས་མཆོད་པར་འགྱུར་ཏེ། འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དུ་ལྷུན་གྲུབ་ཏུ་འབྱུང་བར་འགྱུར་རོ།
en: In this way, all the tathāgatas of the three times in all the buddha fields in the ten directions, as numerous as the particles of dust in the universe, should individually, one by one, along with their retinues and followers, be worshiped with great clouds of offerings.

source: །དཀྱིལ་འཁོར་ཆེན་པོ་གཞལ་དུ་མེད་པའི་མཆོད་པའི་སྤྲིན་གྱིས་མཆོད་པར་བྱེད་དོ། །གང་ཡང་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་རྗེས་སུ་ཞུགས་པའི་སེམས་ཅན་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་།
en: Such offerings are produced effortlessly, ceaselessly arising in cloud-like multitudes from the enclosure of the great maṇḍala. “

source: དམངས་རིགས་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: All beings who enter this maṇḍala—brahmins, kṣatriyas, vaiśyas, śūdras, ascetics, women, men, boys, and girls—will attain mastery of the six perfections.

source: །དེ་ལ་མཐོང་བར་འདོད་པ་དང་། རྗེས་སུ་ཡི་རང་བ་དང་། ལྷན་ཅིག་འགྲོ་བའམ། ཐ་ན་ཐོས་པ་ཙམ་གང་ཡིན་པ་དེ་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: All those who are eager to see it, rejoice in it, associate themselves with it, or merely hear about it will attain the level of not turning back. They too will attain mastery of the six perfections.

source: །སྦྱིན་པ་ཆེན་པོ་ཡོངས་སུ་གཏོང་བ་ཡོངས་སུ་བཏང་བར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་འགྱུར་རོ།
en: They will selflessly practice generosity on a large scale and thus plant the roots of virtue and accumulate great amounts of merit.

source: །སེམས་ཅན་རེ་རེའི་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དང་མཉམ་པ་དེའི་དྲུང་དུ་དགེ་བའི་རྩ་བ་དང་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསྐྱེད་པར་འགྱུར་རོ།
en: They will each plant the roots of virtue and accumulate great merit as if they were in the presence of each of the blessed buddhas, who are as numerous as grains of sand in ninety-nine Gaṅgā rivers. “

source: །དཀྱིལ་འཁོར་མཐོང་བ་ཙམ་གྱི་མོད་ལ། རྗེས་སུ་ཡི་རང་བ་ཙམ་གྱི་མོད་ལ་འཕྲལ་ཉིད་དུ་མཚམས་མེད་པ་ལྔའི་སྡིག་པ་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ། །ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲོལ་བར་ཡང་འགྱུར་རོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བླ་མ་གཅིག་པུར་འགྱུར་རོ།
en: The moment they see the maṇḍala or rejoice in it, their wrongdoings, such as the five acts of immediate retribution, will be instantly exhausted; they will be completely free from every disease and will each become a favorite teacher of all beings.

source: །འཆི་འཕོ་ཞིང་སྐྱེ་བ་བརྗེས་པའི་དུས་སུ་སོན་ཏེ་འཆི་བའི་མཐར་ཐུག་པ་ན། དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་མངོན་སུམ་དུ་སྟོན་ཞིང་སྣང་བར་འགྱུར་རོ།
en: When the time comes to depart this life and take a new birth, they will see ninety-two times a hundred thousand million billion tathāgatas, face-to-face, at the culmination of the death process.

source: །ལམ་ཉེ་བར་སྟོན་པར་བྱེད་ཅིང་དབུགས་འབྱིན་པར་བྱེད་དོ།
en: They will show them the way and give them comfort and encouragement.

source: །སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་པ་རྣམས་སུ་སྐལ་བ་མཉམ་པ་ཉིད་ཀྱི་སྐྱེ་བར་བྱེད་དེ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་པདྨ་ལས་བརྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: These beings will then proceed to their destined buddha fields, where they will be spontaneously born from lotus flowers and be adorned with all ornaments.

source: །སྐྱེས་པ་ཙམ་གྱི་མོད་ལ། སྐྱེ་བ་ཐམས་ཅད་རྗེས་སུ་དྲན་པར་བྱེད་དོ།
en: The moment they are born there, they will be able to recall all their successive births. “

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་ཕྱག་རྒྱ་དང་། གསང་སྔགས་རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོ་དང་།
en: The entire maṇḍala of liberation of Amoghapāśa, complete with its rites and its sets of mudrās and mantras that are common to all tathāgatas, will be clearly known to them as if it were in front of their face.

source: དོན་ཡོད་ཞགས་པའི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་མཐའ་དག་རྫོགས་པར་ཁ་ཏོན་དུ་གནས་པར་བྱེད་དོ། །ཇི་སྲིད་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་མཐར་ཐུག་གི་བར་དུ་ཐམས་ཅད་རྒྱལ་མཚན་གྱི་རྩེ་མོར་བཅིངས་ཏེ་གནས་བར་བྱེད་དོ་ཞེས་སོ།
en: All samādhi states will remain at the top of their banner until their final attainment of buddhahood.

source: །འདི་ནི་སྐྱེ་བའི་ཐ་མར་འགྱུར་ཏེ།
en: The current birth will be their last from a womb. “

source: མཆོད་པ་དང་།
en: The offering maṇḍala is indeed supreme.

source: དཀྱིལ་འཁོར་གྱི་ཆོ་ག་འདི་ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་རི་དགས་དང་བྱ་དེ་དག་ཐམས་ཅད་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཞིང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: At the very least, it will ensure that even those born as animals—as wild animals or birds—will all attain the level of not turning back and obtain mastery of the six perfections.

source: མིར་གྱུར་པ་རྣམས་ཀྱི་ལྟ་ཅི་སྨོས་སོ།
en: What need is then to mention human beings?

source: །དེ་ལྟར་ཡོན་ཏན་དང་ཕན་ཡོན་ཆེན་པོའི་མཆོད་པ་ཆེན་པོ་དང་། དཀྱིལ་འཁོར་གྱི་ཆོ་གའོ།
en: This great offering maṇḍala procedure thus brings great qualities and benefits. “

source: །དོན་ཡོད་པ་ནོར་བུའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་ཕན་ཡོན་གྱི་ཆོ་གའི་སྒྲུབ་ཐབས་སོ།། །།
en: This concludes the practice procedure, with its miraculous benefits, of the heart dhāraṇī of precious amogha offerings. “

source: དེ་ནས་རིག་པའི་རྒྱལ་པོའི་རས་རིས་བཤད་པར་བྱ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བྱེད་པ་སྡིག་པ་ཐམས་ཅད་སེལ་བ་འཕྲལ་དུ་ནད་ཐམས་ཅད་ཟློག་པར་བྱེད་པ་དངོས་གྲུབ་ཐམས་ཅད་བྱེད་པའི་གནས་མཆོག་ཐམས་ཅད་སྦྱིན་པ་བཤད་པར་བྱའོ།
en: Now I will teach a painting procedure for a king of vidyās that brings benefit to all beings. It instantly removes all evil, prevents all disease, brings every accomplishment, and grants every boon.

source: །རས་སམ་གོས་གཞན་ནམ།
en: The vidyā holder should procure a canvas of woven cloth, or of another type such as Chinese silk, that is four cubits square.

source: རྒྱ་དར་ལ་ཀུན་ནས་ཁྲུ་བཞི་པ་ལ་གཙང་མས་གཙང་མའི་གནས་སུ་རི་མོ་མཁན་གཙང་མ་ཉིད་ཀྱིས་ཁྲུས་བྱས་གོས་གཙང་མ་བགོས་ཏེ།
en: The painter should maintain ritual purity and execute the painting in a clean place.

source: དྲི་སྣ་ཚོགས་པས་བདུགས་ལ་མཚོན་སྣ་ཚོགས་པ་རྣམ་པར་བཀྲ་ཞིང་ལྷག་མ་མ་ཡིན་པ་སྣོད་གསར་པར་བཞག་པས་རས་རིས་བླ་ན་མེད་པ་བྲི་བར་བྱའོ།
en: He should take a bath, put on clean clothes, and perfume himself with various scents. He should then execute the supreme painting, using uncontaminated paints of various vivid colors kept in new pots. “

source: །དབུས་སུ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་བྱ་སྟེ། གཞལ་ཡས་ཁང་གི་ཁང་པ་བརྩེགས་པར་སེང་གེའི་ཁྲི་ལ་པདྨའི་རྫིང་བུར་ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་བོ་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་འཐོར་བར་བྱེད་བཞིན་པའོ།
en: In the center of the canvas, the vidyā holder should paint the Tathāgata Śākyamuni sitting on a lion seat on the top floor of his palace, which is surrounded by a lotus lake from which the nāga kings Nanda and Upananda cast flowers toward the Blessed One.

source: །གཡོན་དུ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བྱ་སྟེ། དོན་ཡོད་ཞགས་པ་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པ་རལ་བའི་ཅོད་པན་གྱིས་བརྒྱན་པ་ཚངས་པའི་ཆ་བྱད་འཆང་བ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: To the Blessed One’s left he should paint Noble Avalokiteśvara in his form of Amoghapāśa, sitting in the ardhaparyaṅka posture, adorned with a diadem atop his topknot, and wearing the garb of Brahmā and all kinds of ornaments.

source: འོད་དཔག་མེད་ཀྱི་ཅོད་པན་ཅན། ཕྱག་བཞི་པ། སྤྱན་གསུམ་པ།
en: Amitābha sits as his crest jewel, and he has four arms and three eyes and leans toward the Blessed One.

source: མདུང་རྩེ་གསུམ་འཛིན་པ་པདྨ་འཛིན་པ་དང་། ཞགས་པ་འཛིན་པ་དང་། ནོར་བུ་རིན་པོ་ཆེ་འཛིན་པ། བཅོམ་ལྡན་འདས་ལ་ཉེ་བར་འདུད་པར་བྱེད་བཞིན་པའོ།
en: He holds a trident, a lotus, a noose, and a precious jewel. “

source: །གཡས་སུ་རིག་པའི་རྒྱལ་པོ་བྱ་སྟེ། ཕྱག་བཞི་པ་འཕགས་མ་སྒྲོལ་མའི་ཆ་བྱད་འཆང་བ་འོད་དཔག་མེད་ཀྱི་ཅོད་པན་ཅན།
en: To the right of the Tathāgata Śākyamuni, the vidyā holder should paint the four-armed king of vidyās in the guise of Noble Tārā.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། སྣ་ཚོགས་པའི་གོས་འཛིན་པ།
en: Amitābha is her crest jewel, and she is adorned with all ornaments and wears various items of clothing.

source: པདྨ་དང་ཞགས་པ་དང་། རལ་གྲི་འཆང་ཞིང་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་རྒྱལ་མཚན་ཐོགས་ཏེ།
en: She holds a lotus noose, a sword, a great jewel, and a jeweled victory banner.

source: བཅོམ་ལྡན་འདས་ལ་ཉེ་བར་འདུད་པར་བྱེད་པ་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པའོ།
en: She sits in the ardhaparyaṅka posture and leans toward the Blessed One. “

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རྒྱབ་ཏུ་ལྷ་མོ་སྒྲོལ་མ་བྱ་སྟེ། ཐལ་མོ་སྦྱར་བ་སྨད་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པའོ།
en: Behind Noble Avalokiteśvara, the vidyā holder should paint the goddess Tārā adorned with all kinds of ornaments and leaning toward the Blessed One with folded hands.

source: །ལྷ་མོ་སྒྲོལ་མའི་རྒྱབ་ཏུ་གོས་དཀར་མོ་བྱ་སྟེ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ་རབ་ཏུ་བཞད་ཅིང་སྨིན་མ་དཔྲལ་བར་གཡོ་ཞིང་།
en: Behind the goddess Tārā, he should paint Pāṇḍaravāsinī adorned with all kinds of ornaments.

source: བཅོམ་ལྡན་འདས་ལ་ཟུར་མིག་གིས་ལྟ་བར་བྱེད་པ་བྱའོ།
en: He should paint her smiling, with arched eyebrows, and casting sidelong glances at the Blessed One.

source: །རིག་པའི་རྒྱལ་པོའི་རྒྱབ་ཏུ་འཕགས་པ་དཔལ་མཛེས་པ་བྱ་སྟེ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ།
en: Behind the king of vidyās he should paint Noble Śrīkānti adorned with all kinds of ornaments.

source: བཅོམ་ལྡན་འདས་ལ་ལྟ་བར་བྱེད་བཞིན་པ་སྣ་ཚོགས་པའི་མེ་ཏོག་གི་ཕུར་མ་འཆང་བར་བྱེད་པའོ།
en: She looks at the Blessed One and carries a vase with various flowers.

source: །ཐམས་ཅད་ལ་པདྨའི་གདན་བྱ་སྟེ། སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པ་བྱའོ།
en: All these goddesses sit in the ardhaparyaṅka posture upon lotus seats. “

source: །གོས་དཀར་མོའི་རྒྱབ་ཏུ་ཁྲོ་བོ་ཆེན་པོ་ལྕགས་ཀྱུ་བྱའོ།
en: The vidyā holder should then paint the great Krodhāṅkuśī behind Pāṇḍaravāsinī, and Amoghāṅkuśī besides Śvetā.

source: །དཀར་པོའི་གཞོགས་སུ་དོན་ཡོད་པའི་ལྕགས་ཀྱུ་བྱའོ། །རིག་པའི་རྒྱལ་པོའི་འོག་ཏུ་རལ་པ་གཅིག་མ་བྱ་སྟེ། ཕྱག་བརྒྱད་པ། ཞལ་མཆེ་བ་གཙིགས་པ།
en: Below the king of vidyās, he should paint Ekajaṭā with eight arms and fangs bared.

source: རལ་པ་གྱེན་དུ་བརྫེས་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པ། མཚོན་ཆ་སྣ་ཚོགས་པ་འཛིན་པ་སྟེ། རལ་གྲི་དང་།
en: Her knotted hair flies upward, and she is adorned with every ornament.

source: དགྲ་སྟ་དང་། ཞགས་པ་དང་། རལ་གྲི་དང་། མདུང་རྩེ་གསུམ་དང་། རྡོ་རྗེ་དང་།
en: She holds various implements in seven of her hands—a scimitar, axe, noose, sword, trident, vajra scepter, and lotus—and displays a threatening gesture with her remaining hand.

source: པདྨ་འཆང་བ་བྱ་ཞིང་སྡིགས་མཛུབ་བྱེད་པ་བྱའོ། །སྟེང་དུ་ཕྱོགས་པ་སྐྱིལ་ཀྲུང་ཕྱེད་པས་བཞུགས་པ་བཅོམ་ལྡན་འདས་ལ་ལྟ་བར་བྱེད་བཞིན་པའོ།
en: She sits in the ardhaparyaṅka posture and looks up at the Blessed One with an upturned face. “

source: །ཁང་པ་བརྩེགས་པའི་སྟེང་དུ། དེ་བཞིན་གཤེགས་པ་བདུན་བྱ་སྟེ། འོད་དཔག་མེད་ཀྱང་དབུས་སུ་བྱའོ། །ལྷས་མཆོད་པ་བྱེད་བཞིན་པ་བྱའོ།
en: The vidyā holder should paint Amitābha at the center of the seven tathāgatas above Śākyamuni’s palace, all worshiping the Blessed One.

source: །ཕྱག་གཡོན་དང་གཡས་སུ་རྡོ་རྗེ་འཛིན་པ། བཅོམ་ལྡན་འདས་ལ་ཟས་གསར་པ་འདྲེན་པར་བྱེད་བཞིན་པའོ།
en: To the right, he should paint Vajradhara fanning the Blessed One with a yak-tail whisk held in his left and right hands.

source: །གཞོགས་གཡས་དང་གཡོན་དུ་ཁྲོ་བོའི་རྒྱལ་པོ་རྡོ་རྗེ་འཆང་བ་བྱའོ། །འོག་གི་གཞོགས་གཡས་སུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་བྱའོ། །གཞོགས་གཡོན་དུ། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་པོ་དང་། གཞོན་ནུ་རྣམས་རང་རང་གི་མཚོན་ཆ་འཛིན་པ་བྱ་སྟེ།
en: He should paint Vajradhara-Krodharāja to the left, the Four Great Kings below and to the right, and Yama, Varuṇa, Kubera, and Kumāra below and to the left, each holding their respective implements.

source: ཐམས་ཅད་གླུ་ལེན་བཞིན་པ་བྱའོ།
en: All of them should be depicted to be singing.

source: །བཅོམ་ལྡན་འདས་འོག་ཕྱོགས་ཀྱི་རྫིང་བུའི་གཡས་ལོགས་སུ་རིག་སྔགས་འཆང་པུས་མོ་བཙུགས་པ་བྱ་སྟེ། བདུག་པའི་པོག་ཕོར་དང་། མེ་ཏོག་འཛིན་ཅིང་བགྲང་ཕྲེང་ཐོགས་པ། བཅོམ་ལྡན་འདས་ལ་ལྟ་བར་བྱེད་བཞིན་པ་བྱའོ།
en: The vidyā holder should be painted below the Blessed One, kneeling on the right side of the lotus lake and looking up at the Blessed One. He holds an incense burner, flowers, and a rosary. “

source: །རས་རིས་ཀྱི་ཁོ་ར་ཁོར་ཡུག་ཏུ་རི་བོ་བྲི་བར་བྱ་སྟེ། སྣ་ཚོགས་མེ་ཏོག་གི་མགོ་ལྕོགས་བཀྲམ་ཞིང་། རིན་པོ་ཆེའི་ཤིང་ལྗོན་སྣ་ཚོགས་པས་བརྒྱན་པ། ཆུ་བོ་འབབ་ཅིང་རྗེས་སུ་སྤྱོད་པ།
en: Around the outer edge of the canvas, the vidyā holder should paint a ring of mountains strewn with various flowers and blossoms, adorned with various jeweled trees interspersed with flowing streams of water, and teeming with wild animals and birds.

source: རི་དགས་དང་། བྱས་ཡང་དག་པར་བརྒྱན་པ་བྱའོ། །སྣ་ཚོགས་པའི་རིའི་ལྷ་དང་། ཤང་ཤང་ཏེ་འུས་ཀུན་ཏུ་ཁྱབ་པ།
en: The mountains should be graced with various mountain deities and pheasants, and they should be dotted with the expanded hoods of various snakes.

source: རྣམ་པ་སྣ་ཚོགས་པའི་ཀླུའི་གདེངས་ཀ་དང་མཚུངས་པ་གནས་སུ་གནས་པ་བྱའོ།
en: The vidyā holder should also paint other mountain inhabitants in their respective abodes.

source: །དེ་ནས་ཡོངས་སུ་སྦྱང་བ་བྱས་ཏེ་ཟིན་པ་དང་། རས་རིས་ལ་ཚོན་སྣ་ཚོགས་པས་བཀྲ་བར་བྱའོ།
en: He should then apply various bright colors to finish the painting. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོ་བར་བྱའོ། །ལེགས་པར་ཁྲུས་བྱ་སྟེ།
en: Then, the vidyā holder should be ritually pure, wear clean clothes, and be thoroughly bathed.

source: སྐྱིལ་མོ་ཀྲུང་གིས་འདུག་སྟེ། སྨྲ་བ་བཅད་ལ།
en: He should sit in a cross-legged position facing the painting and observe silence.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་དང་། རིག་པའི་རྒྱལ་པོའི་གཟུངས་ལན་བརྒྱ་རྩ་བརྒྱད་དུ་བཟླས་སོ།
en: He should then recite the heart mantra of Amoghapāśa one hundred and eight times and the dhāraṇī of the king of vidyās another one hundred and eight times.

source: །དེའི་ཚེ་རས་རིས་འབར་བར་འགྱུར་རོ། །འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་པ་འབྱིན་པར་བྱེད་དེ། ཕྱོགས་བཅུ་ཀུན་ཏུ་སྣང་བར་བྱེད་དོ། །རིག་སྔགས་འཆང་དགའ་ཞིང་འདོད་པར་འགྱུར་ཏེ། རིག་སྔགས་འཆང་གིས་བདག་གི་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་དང་།
en: The cloth painting will subsequently blaze with light and radiate rays of various colors that illuminate all ten directions. “

source: དོན་ཡོད་ཞགས་པའི་ལྕགས་ཀྱུ་དང་།
en: Covered in goose bumps, the vidyā holder will tremble with excitement.

source: རིག་པའི་རྒྱལ་པོའི་སྙིང་པོ་འདིའི་དངོས་གྲུབ་ཏུ་ཤེས་པར་བྱའོ།
en: He will understand that he has now accomplished Amoghāṅkuśa, the king of vidyās, the heart essence of Amoghapāśa.

source: །དེ་ནས་ལས་ཐམས་ཅད་བྱེད་དུ་གཞུག་ཅིང་། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་མཆོག་འགྲུབ་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། རྒྱལ་པོ་འམ། བློན་པོ་འམ། བྲམ་ཟེ་འམ། རྒྱལ་རིགས་སམ། ཁྱིམ་བདག་གམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ།
en: From then on, he will be able to perform all activities, both mundane and supramundane, and accomplish all of them perfectly.

source: བུད་མེད་དམ། སྐྱེས་པའམ། ཁྱེའུ་འམ། བུ་མོ་གང་རས་རིས་ཆེན་པོ་འདི་མཐོང་ནས། མཐོང་བ་ཙམ་གྱི་མོད་ལ་མཚམས་མེད་པ་ལྔའི་སྡིག་པ་རྣམ་པར་སྦྱངས་ཤིང་ཐུན་ཚགས་སུ་འགྱུར་རོ།
en: Any son or daughter of good family, any monk or nun, any male or female lay practitioner, any king, minister, brahmin, kṣatriya, householder, or male or female lay practitioner, or any woman, man, boy, or girl who sees this great painting will be freed from their wrongdoings, such as the five acts of immediate retribution and other moral stains, as soon as they see the painting.

source: །མནར་མེད་པའི་སྡིག་པ་དང་སྒྲིབ་པ་རྣམས་འཕྲལ་དུ་ཡོངས་སུ་གྲོལ་ལོ།
en: They will instantly be freed from their wrongdoings and obscurations that would otherwise lead to rebirth in the Avīci hell.

source: །བསོད་ནམས་ཀྱི་ཚོགས་དགེ་བའི་རྩ་བ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར་རོ།
en: They will accumulate a great amount of merit and plant roots of virtue. “

source: །རིག་པའི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་འདོད་པ་ཐམས་ཅད་དང་ཡིད་ཀྱི་ཤིང་རྟ་དང་། འདོད་པའི་དངོས་གྲུབ་ཐམས་ཅད་དང་།
en: Now I will teach the maṇḍala of the king of vidyās that fulfills all wishes, brings all desired accomplishments, and allows the vidyā holder to realize the sameness of the tathāgata families.

source: རིགས་ཐུན་མོང་པ་ལ་འཇུག་པའི་ཐམས་ཅད་ཐུན་མོང་བའི་དམ་ཚིག་དང་། དེ་ཁོ་ན་ཉིད་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་རློབ་པ་དང་། ཐམས་ཅད་དུ་དངོས་གྲུབ་བྱེད་པའི་གནས།
en: This maṇḍala is a receptacle for the blessing of all tathāgatas and is the source of the accomplishment of the samaya and the essence that they all share.

source: རྡོ་རྗེའི་གདན་གྱི་དཀྱིལ་འཁོར་མཆོག་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ཉེ་བར་བགྲོད་པར་བྱེད་པ་དེ་ཁོ་ན་ཉིད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བར་བྱེད་པའི་དཀྱིལ་འཁོར་ཕྱིར་མི་ལྡོག་པར་འཇུག་པར་བྱེད་པ།
en: This supreme maṇḍala constitutes the vajra seat of awakening, and it effects, by its very nature, the turning of the wheel of Dharma. It brings the vidyā holder close to final and ultimate awakening and establishes him on the level of not turning back.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར། གནས་ཐམས་ཅད་དུ་སོན་པའི་དངོས་གྲུབ། ཆོ་ག་ཞིབ་མོའི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་འཇུག་པར་བྱེད་པ།
en: It is a secret maṇḍala of all the tathāgatas that grants the magical ability to reach any location and serves as a maṇḍala suitable for all rites.

source: ཕྱག་རྒྱ་ཐམས་ཅད་འགུགས་པར་བྱེད་པའི་ཕྱག་རྒྱ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་རབ་ཏུ་འཇུག་པར་བྱེད་པ་བཤད་པར་བྱའོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་གནས་ཡོངས་སུ་བརྟགས་ཏེ།
en: Its mudrā summons the power of all mudrās and allows the vidyā holder to enter all the buddha fields. “

source: སའི་ཆ་མཛེས་པར། གཙུག་ལག་ཁང་ངམ། དགོན་པའམ། གནས་གཉིས་སམ། རི་ཕུག་གམ། ཚང་ཚིང་ངམ། རྒྱལ་པོའི་གནས་སམ། ལམ་གྱི་བཞི་མདོ་འམ། གཞན་ཡང་བྲང་སའམ།
en: The vidyā holder should find a suitable place on a suitable spot on the ground.

source: དགེ་འདུན་གྱི་ཀུན་དགའ་ར་བའམ། སྐྱེད་མོས་ཚལ་ལམ། ནགས་འདབ་ཉིད་དང་། ཀུན་དགའ་ར་བའམ། ཆུ་ཀླུང་ངམ། ལྟེང་ཀའམ། འབབ་ཆུའི་དངོའམ། མཚོ་བྲན་ནམ། མཚེའུ་དག་དང་། རྫིང་བུ་རྣམ་པར་བཀྲ་བའམ། དེ་བཞིན་གཤེགས་པའི་ཚོན་ནམ། ནེའུ་གསིང་སྔོན་པོའམ། མེ་ཏོག་སྐྱེས་པའི་གནས་སམ།
en: He should look for the right spot in places such as a monastery courtyard, a forest hermitage, an inaccessible mountain cave or wilderness, a city, a royal capital, a crossroads, a residential estate, a monks’ recreation ground, a garden, park, grove, pleasure ground, river, pond, or pool, a lake adorned with lotuses, or a place pleasing to tathāgatas such as a verdant spot abounding in fresh greenery or a flower garden. “
